[
  {
    "id": 1,
    "title": "Algoritm haqida (1-dars)",
    "about": "Algoritm nima? Algoritm bu ma'lum bir vazifani bajarishga qaratilgan kichik dastur",
    "dataText": [
      {
        "text": "Algoritm nima? Algoritm bu ma'lum bir vazifani bajarishga qaratilgan kichik dastur. Algoritm tushunchasini kengroq qilib tushintirganda, berilgan masalani yechish uchun ketma-ketliklar majmuasidir."
      },
      {
        "text": "Algoritmni hayotimizda juda ko'p sohalarda ishlatiladi: chorraxada svetafor, binolarda lift. Hattoki o'zimiz oddiy hayotiy ishlarda ham algoritm ishlatamiz: choynakga choy damlash. Algoritmlarning komputer sohasida ham muhim ro'l o'ynaydi. Chunki, dasturchi yozgan dasturlar hammasi ma'lum bir ketma-ketlik bilan ishlaydi."
      }
    ]
  },

  {
    "id": 2,
    "title": "API nima? Boshlovchilar uchun oddiy tushuncha",
    "about": "Ushbu maqolada API haqida bilib olishingiz, API nima, uning ishlashi haqida umumiy ma'lumotlarga ega bo'lishingiz mumkin",
    "dataText": [
      {
        "text": "Bu atama dasturlash bilan ozgina bo'lsa ham shug'ullangan odam uchun nimanidir anglatadi. Lekin, hamma ham u nimani anglatishini va u nimaga kerakligini to'liq tushunishmaydi. Dastuchi Pyoter Gazarov API haqida oddiy tilda o'zining blogida gapirib berdi."
      },
      {
        "text": "API abbereviaturasi \"Application Programming Interface\" so'zlarining bosh harflaridan olingan bo'lib, dasturlarni dasturlash interfeysi yoki dastularni dasturiy interfeysi deb tarjima qilinadi. Ko'plab katta kompaniyalar ma'lum darajaga yetishganda, o'z mijozlari yoki kompaniya ichida qo'lanilishi uchun, API yaratishadi. API'ni dastur yaratishda yoki biznesda qanday qo'llanilishi tushunish uchun avvalo \"butunjahon o'rgimchak to'ri\" qanday ishlashi bilan tanishib chiqish kerak bo'ladi."
      },
      {
        "text": "WWW'ni bir-biri bilan bog'langan, serverlarning katta tarmog'i sifatida tasavvur qilish mumkin va ularda har bitta sahifa saqlanadi. Oddiy noutbukni tarmoqda butun bir sayt ishlashini ta'minlaydigan serverga aylantirish ham mumkin. Lokal serverlar esa, dasturchilarga ular sayt yaratishlari uchun vaqtincha server vazifasini bajarishi mumkin. Brauzerning manzil qatorida www.facebook.com yozilganda, boshqa joydagi facebook serveriga kerakli so'rov yuboriladi. Brauzer serverdan javob olish bilanoq u kodni interpretatsiya qiladi(\"chizadi\") va foydalanuvchiga sahifani ko'rsatadi."
      },
      {
        "text": "Foydalanuvchi har gal tarmoqdagi qaysidir sahifaga tashrif buyurganda u boshqa joydagi server API'si bilan bog'lanadi. API - serverning asosiy qismi bo'lib, u so'rovlar qabul qiladi va ularga javoblar qaytaradi."
      }
    ]
  },

  {
    "id": 3,
    "title": "Linkedinda profilingizni to'g'ri to'ldiring",
    "about": "Linkedin bu Sizning onlayn rezyumeyingiz va har bir dasturchida yaxshi onlayn rezyume bo'lishi shart",
    "dataText": [
      {
        "text": "Linkedin bu Sizning onlayn rezyumeyingiz va har bir dasturchida yaxshi onlayn rezyume bo'lishi shart. Ayniqsa agar karyerangiz endi boshlangan bo'lsa, Linkedindan to'g'ri foydalanish juda muhim. Delivery Hero ham meni Linkedindan topgan va ko'chib kelishimga ko'maklashgan."
      },
      {
        "text": "Siz ham quyidagilardan foydalanib profilingizni sifatini oshirishingiz mumkin 👇"
      },
      {
        "text": "1. Profil sarlavhasi (headline): Boshqalar birinchi ko'radigan narsa bu profilingiz sarlavhasi. Siz birinchi taassurotni qanday qoldirishingiz shu so'zlarga bog'liq. Bu yerda men hozir nima ish qilishimni yozganman: Software Engineer at Anaconda. Chunki bu shu paytgacha erishgan eng katta yutug'im. Agar siz birinchi ish qidirayotgan bo'lsangiz Looking for frontend oppotunities deb yozib qo'yishingiz mumkin. Agar bunday yozish yoqmasa, Junior Frontend Engineer desangiz ham bo'ladi ✅. Shunda profilingiz qidiruv natijalarida teparoqda chiqadi. God willing, I will be the best in the world deb yozib yurmang ❌"
      },
      {
        "text": "2. Profildagi rasm: Ikkinchi ko'zga tashlanadigan narsa bu rasmingiz. Iloji boricha professional rasm bo'lish kerak va asosan tanangizning tepa qismi, yuzingiz yaxshi ko'ringan bo'lishi kerak. Qandaydir selfie yoki Tinder profilingizdagi rasmni bu yerga qo'yib yurmang ❌"
      },
      {
        "text": "3. Profile summary: Uchinchisi bu summary. Bu yerda siz qisqa va lo'nda qilib o'zingiz haqingizda va ish qidirayotgan bo'lsangiz qanday ish izlayotganingizni yozishingiz kerak. Eng kuchli taraflaringizni, nimalarni bilishingizni shu yerda yozsangiz bo'ladi. Hullas, o'zingizni \"soting\". Bu maqtanish emas. Dunyodagi eng zo'r dasturchi bo'lsangiz ham hech kim buni bilmasa, nima foyda? Yaxshi summary uchun misollar: https://bit.ly/2WSM3v6 ✅ Odnoklassniki.ru da ishlatiladigan statuslaringizni bu yerda yozib yurmang ❌"
      },
      {
        "text": "4. Tajribalaringiz: Tajribalaringizni to'g'ri to'ldirishingiz birinchi (HR bilan) va ikkinchi (Rezyume discussion) intervyudan o'tishga juda katta yordam beradi. Shunga qaramasdan ko'pchilik juda ham umumiy malumotlarni yozib qo'yadi bu yerda. Undan ko'ra, o'tgan ish joylaringizda aniq nima ish qilganingiz haqida yozishingiz kerak, ko'proq raqamlar berishingiz kerak ✅."
      },
      {
        "text": "5. Activity. Linkedinda nima ish qilsangiz qolganlar shu qilgan ishlaringizni ko'ra oladi. Qanday postlar qo'ygansiz, qanday postlarga \"Like\" bosgansiz va hokazo. Linkedin bu professional social network. Professional karyerangizga tegishli bo'lgan ishlarni qiling ✅ Undan boshqa ishlarni facebook, tinder yoki telegramda qilaverasiz. Jinni ketti postlar yozib, g'alati postlarga like bosib yurmang ❌."
      },
      {
        "text": "6. Maxsus URL: Linkedinda birinchi profil yaratganingizda, u sizga g'alati ko'rinishdagi URL beradi. Masalan: https://www.linkedin.com/in/jakhongir-rakhmonov-81ab64176/. Bu professional ko'rinishga ega emas. Shuning uchun uni o'zgartiring ✅. Meniki quyidagicha: https://www.linkedin.com/in/jahongirrahmonov/. Qanday o'zgartirishni bu yerda ko'rishingiz mumkin: https://bit.ly/3zHhebf"
      },
      {
        "text": "Berilgan URLni shundayligicha qoldirib yurmang ❌"
      },
      {
        "text": "7. Tavsiyalar: Eski ham-kasblaringizdan siz haqingizda bir ikki og'iz gap yozib qo'yishlarini so'rang ✅. Sizni tanimagan odam profilingizga kirganda tavsiyalar yaxshi taassurot qoldiradi. Bu zo'r bola deb yozib qo'yishmasin yana ❌"
      },
      {
        "text": "Qolgan qismlarini ham esdan chiqarmang. Shunda sizga All-star statusi beriladi va profilingiz qidiruv natijalarida teparoqda chiqadi."
      }
    ]
  },
  {
    "id": 4,
    "title": "MySQL turlari va talqinlar tushunchasi (1-dars)",
    "about": "Bu maqolada mysql turlari, qaysilari tekin, qaysilari pullik ekanligini, talqin tushunchasi va ko'chirib olish uchun qanday fayllar taklif qilinishini ko'rib chiqamiz.",
    "dataText": [
      {
        "text": "MySQL bu — krossplatformali dastur hisoblanadi, ya'ni bir xil tipga ega bo'lgan(ishlash texnologiyasi bir xil), lekin o'rnatiluvchi fayllari biroz boshqachadir. Hozirda mysql Oracle firmasi tomonidan ishlab chiqarilmoqda, oldin Sun firmasiga tegishli bo'lgan. Shuning uchun MySQL 4 talqini MySQL 5 talqinidan farq qiladi. Hozirda(maqola yozilishida) eng so'ngi talqini 5.6.14 dir."
      },
      {
        "text": "Keling enda,talqinlar nimani anglatishini bilib olamiz. Har bir dastur, ma'lum bir sonlar asosida talqinlarga ajratiladi. Dastur ismi o'zgarmaydi, faqat sonlar o'zgarib, dasturning yangi yoki eskiligini ajratib turadi. Yangi yoki eskiligi, dasturning darajasini belgilaydi, ya'ni yangi dastur eskisiga qaraganda yangi qirralari mavjudligini anglatadi. MySQL dasturi ham hamma dasturlar kabi o'z talqiniga ega(5.6.14). Demak birinchi raqam asosiy raqam deyiladi. Bizning holatda bu 5 raqami. Bu raqam kamdan kam o'zgaradi, faqatgina dasturning asosi o'zgarsa o'zgaradi. Keyingi raqam 6, bu raqam asosiy raqamga yordamchi raqam hisoblanadi va asosiy raqamga qaraganda tezroq o'zgaradi. Buning o'zgarishi, dasturning ishlash texnologiyasi biroz o'zgarishi natijasida sodir bo'ladi. Keyingi raqam build deyiladi. Bizning holatda bu 14 raqam. Dastur ishlashida biror nuqson(bug) paydo bo'lsa, dasturchilar darrov shu nuqson(bug)ni yo'qotishadi va raqamni keyingisiga o'zgartirib qo'yishadi. Bundan ko'rinib turibdiki bu raqam tez o'zgaradi. Bu o'zgartirish dasturchilar tilida Patch deyiladi. O'z tajribamdan kelib chiqib fikr bildirsam, har bir yangi chiqgan Patch, eski nuqsonlarni bartaraf etib, yangisini paydo qiladi :)."
      },
      {
        "text": "MySQL asosan 2 turga bo'linadi. Birinchisi, pullik talqin bo'lib, MySQL Enterprise Server deyiladi. Bu turidan foydalanganda, har yil ma'lum bir mablag' to'lash talab etiladi."
      },
      {
        "text": "Ikkinchisi, MySQL Community Server deb nomlanib, bepul hisoblanadi."
      },
      {
        "text": "MySQL Enterprise Serverni MySQL Community Serverdan farqi, Enterprise tipi o'zida barcha utilitlarni qamrab oladi va chiqayotgan barcha yangi patch va o'zgarishlar dastlab shu tipiga chiqariladi va ancha vaqtdan so'ng Community tipiga chiqadi. Undan tashqari Enterprise tipida klaster texnologiyasi ham mavjud. Biz uchun Community tipi ham yetarli hisoblanadi va shu tipini o'rganib boramiz."
      },
      {
        "text": "MySQL Community tipining ham 2 turi mavjud bo'lib, biri Essentials(boshlang'ich) talqini, ikkinchisi Installer deyiladi. Essential turida faqat server mavjud bo'lib, hech qanday qo'shimcha komponenlar yo'q, Installerda esa bir necha qo'shimcha komponentlar mavjud bo'lib, hajmi ham kattaroq. Essential talqini zip arxivda beriladi, Installer esa msi fayli ko'rinishida bo'ladi."
      },
      {
        "text": "Undan tashqari mysql ni ko'chirib olishda, operatsion tizimning qaysi bitligini ham inobatga olish lozim. Saytda ham, 64 va 32 uchun alohida mysql dasturini fayllari taklif qilinadi."
      },
      {
        "text": "MySQL ishlashi uchun, hech qanday Apache serveri, hech qanday PHP kerak emas. Faqatgina bazani o'zini o'rganmoqchi bo'lsangiz, Apache PHP larni o'rnatmang. Bular faqat to'liq sayt yaratish uchun kerak. To'g'ri bularni o'rnatish ham qiyin emas, lekin ortiqcha narsalar. Bazani mukammal o'rganganingizdan so'ng qolgan narsalarni o'rnatib, sozlovchi fayllar orqali bir birlarini bog'lab olasiz."
      },
      {
        "text": "Ya'na bir narsa, ko'pchilik saytlarda oldin Apache qo'ying, keyin mysql va oxirida PHP ni o'rnating degan maqolalarni uchratish mumkin. Umuman olganda ketma-ketlikning umuman farqi yo'q, birgalikda ishlashsa ham, bular hammasi alohida — alohida dasturlar."
      },
      {
        "text": "Agar hali ham mysql nimaligini anglay olmagan bo'lsangiz, oxirgi tushuntirish gaplarini yozaman, bu — ma'lumotlar bazasini boshqarish tizimi bo'lib, bu tizimga sinonim tizim qilib, Oracle, MS SQL SERVER larni misol qilish mumkin."
      }
    ]
  },
  {
    "id": 5,
    "title": "NoSql - Umumiy tushunchalar (1-dars)",
    "about": "NoSql(Not Only SQL yoki No Sql) tushunchasi 2009-yildan boshlab mashhur bo'la boshladi",
    "dataText": [
      {
        "text": "NoSql(Not Only SQL yoki No Sql) tushunchasi 2009-yildan boshlab mashhur bo'la boshladi. Aynan o'sha davrda web texnologiyalar va ijtimoiy xizmatlar ma'lumotlarni saqlash va ular ustida amallar bajarish usullari rivoji uchun yangi turtki berdi."
      },
      {
        "text": "Bunday loyiha yaratuvchilari odatiy ma'lumotlarni saqlash tizimlari mos kelmaydigan yoki juda ham qimmatlik qiladigan masalalarini hal qilishlariga to'g'ri keldi. Bundan tashqari, bunday ma'lumotlar omborini boshqa yangi turdagi ma'lumotlar omboriga almashtirishga startapchilar va \"Big Data\"lar bilan ishlovchilar sababchi bo'lishdi."
      },
      {
        "text": "Shuni tushunish kerakki, NoSql bu odatiy ma'lumotlar omboridan butunlay voz kechish emas. Odatda biron bir ish quroli ma'lum bir muommoni hal qilish uchun eng qulay bo'lganligi uchun tanlanadi. NoSql haqida gapirishgandi odatda quyidagi ustunliklarini sanab o'tishadi."
      },
      {
        "text": "Masshtablanuvchanlik. Odatiy ma'lumotlar omborida mavjud bo'lgan gorizontal masshtablash juda katta mehnatni, juda katta moliyaviy resurslarni talab qiladi va albatta faqat ma'lum turdagi masalalarni hal qilish uchun mos keladi holos. Ko'plab NoSql ma'lumotlar omborlari esa aynan gorizontal masshtablashni hisobga olgan holda loyihalashtirilgan. Va bu masshtablashni hech qanday qiyinchiliklar amalga oshirish mumkin bo'ladi."
      },
      {
        "text": "Ishlash tezligi. Ma'lumotlar ombori klasterda emas balki bitta tugundaligi ham asosiy parametrlardan biri hisoblanadi. Ko'plab masalarni hal qilish uchun odatiy ma'lumotlar omborlarini tranzaktsionlik, o'zgarishlarni ajratish, bitta tugundan tashqaridagi ishonchliligi va aynan bog'langa ma'lumotlar omborlari kerak bo'lmasligi. Shu sababli shu xususiyatlaridan butunlay yoki qisman voz kechishlik NoSqlga bitta tugunda katta tezlikga erishishga yordam beradi."
      }
    ]
  },
  {
    "id": 6,
    "title": "Oracle ma’lumotlar bazasini boshqarish tizimi haqida",
    "about": "Oracle (Ma'lumotlar Bazasini Boshqarish Tizimi) – katta hajmdagi ma'lumotlarni boshqarish, ulardan kerakli ma'lumotlarni so'rov orqali istalgan ko'rinishda chiqarib olish...",
    "dataText": [
      {
        "text": "Oracle (Ma'lumotlar Bazasini Boshqarish Tizimi) – katta hajmdagi ma'lumotlarni boshqarish, ulardan kerakli ma'lumotlarni so'rov orqali istalgan ko'rinishda chiqarib olish, ma'lumotlarning zahira nusxalarini olish, katta xajmdagi ma'lumotlarni siqish, qulay interfeysda baza ustidan nazorat o'rnatish, ma'lumotlar asosida hisobotlar hosil qilish va bulardan boshqa ma'lumotlar ustida juda katta ko'lamdagi ishlarni amalga oshiradigan dasturiy kompleksdir. Oracle dasturini server va klient ko'rinishida o'rnatish mumkin va berilgan ruxsat doirasida ishlatish mumkin. Bu dastur asosan katta xajmdagi ma'lumotlar bilin ishlaganligi uchun , asosan yirik korxonalarda ishlatiladi. Bu dasturning asosini ma'lumotlar bazasi tushunchasi tashkil etadi."
      },
      {
        "text": "Ma'lumotlar bazasi – bu serverda joylashgan bir yoki bir necha fayllardan tashkil topgan, shu serverga yig'iladigan va so'rovlar orqali nazorat qilib boriladigan ma'lumotlardir. Ma'lumotlar bazasi mantiqiy va jismoniy ko'rinishda bo'lishi mumkin. Mantiqiy ko'rinishdagi ma'lumotlar bazasining asosini jadvallar tashkil etadi. Jadvallar ustun va qatorlardan tashkil topgan bo'lib, ular birlashgan joy(yacheyka) da ma'lumotlarni saqlaydi. Bu ko'rinishdagi ma'lumotlar bazasi \" реляционная база данных \" deyiladi. Baza eng kamida jadvaldan tashkil topgan bo'lishi shart, bu shart ma'lumotlar bazasi mavjud bo'lishning eng minimum shartidir."
      },
      {
        "text": "Bazada saqlanayotgan ma'lumotlarni xafsizligini saqlash maqsadida Oracle(MBBT) da juda ko'p ishlar amalga oshirilgan, biz ularni keyingi maqolalarda ko'ramiz. Ma'lumotlar bazasini tashkil etgan fayllarni: ma'lumotlar bazasi fayllari va ma'lumotlar bazasiga tegishli bo'lmagan fayllar ko'rinishida ajratishimiz mumkin. Ma'lumotlar bazasi fayllarida ma'lumotlar saqlanadi, ma'lumotlar bazasiga tegishli bo'lmagan fayllarda har xil protokollar, sozlashlar kabi qo'shimcha ma'lumotlar saqlanadi. Bu ma'lumotlar bilan Oracle administratorlari ruxsat bergan foydalanuvchilargina ishlay oladi."
      },
      {
        "text": "Oracle ning juda ko'p utilitlari(Rman, Oracle Data Guard, Oracle Data Grid,… ) mavjud bo'lib, ular ham ma'lumotlarni foydalanuvchi uchun qulay ko'rinishda taqdim etish(boshqarish, nazorat qilish) uchun ishlatiladi. Misol tariqasida Rman utilitasini oladigan bo'lsak, bu utilita bazani to'liq yoki qisman zahira nusxalarini juda katta xajmga kamaytirib(siqib) hosil qiladi va saqlash uchun o'zi chunarli bo'lgan kodlarga aylantiradi. Bazaga shikast etganda shu zahira nusha orqali bazani qayta tiklash mumkin bo'ladi."
      },
      {
        "text": "Oracle SQL kodlari orqali buyruqlarni qabul qiladi. Bu so'rov tili ma'lumotlar bazasini yuklash, uni to'xtatish, montirovka qilish, jadvallar yaratish, o'chirish, o'zgartirish, ma'lumotlar ichidan kerakligini chiqarib olish va boshqa vazifalar uchun ishlatiladi. Bu til juda ko'p Ma'lumotlar Bazasini Boshqarish Tizim lari uchun umumiy hisoblanadi. SQL kodlari bir yoki bir necha jadvallar ustida so'rovlarni amalga oshira oladi."
      },
      {
        "text": "Ma'lumotlarni boshqarishda foydalanuvchilarga qulaylik yaratish maqsadida Oracle dasturi yaratuvchilari Oracle Enterprise Manager deb nomlangan web sahifa yaratishgan bo'lib, bu sahifa orqali butun Oracle ni boshqarish mumkin bo'ladi. SQL kodlarini bilmaydigan foydalanuvchilar ham bu web sahifa orqali barcha vazifalarni bajarishi mumkin, faqatgina kerakli \"ссылка\" larni bosish kifoya. Har bir ma'lumotlar bazasi uchun alohida-alohida Enterprise Manager sahifasi bo'ladi, har bir sahifa portlar orqali ajratiladi. Barcha brauzerlarda bu sahifa yaxshi namoyon bo'ladi va bazani xafsizligiga portlarni boshqarish yo'li bilan erishish mumkindir."
      }
    ]
  },
  {
    "id": 7,
    "title": "Sizga startap ochishga xalaqit beruvchi 6 bahona",
    "about": "Siz o'z ishingizni ochishni qachondan beri istab kelayotgan bo'lsangiz-u, biroq hanuzgacha boshlamagan bo'lsangiz, demak quyida tilga olinadigan iboralardan birini...",
    "dataText": [
      {
        "text": "Siz o'z ishingizni ochishni qachondan beri istab kelayotgan bo'lsangiz-u, biroq hanuzgacha boshlamagan bo'lsangiz, demak quyida tilga olinadigan iboralardan birini bahona sifatida ishlatgansiz. Ular shunchaki bir bahona ekani va ulardan qanday qilib voz kechish mumkinligi haqida hikoya qilamiz."
      },
      {
        "text": "1. «Men oilamni boqishim kerak»"
      },
      {
        "text": "Ha, ilk davrlarida startaplarning aksariyati pul keltirmaydi. Biroq doimo pul ishlash uchun qo'shimcha ish topish mumkin, masalan, maslahatchi yoki frilanserlik bilan. Ish joyiga sutkalab gumdon bo'lib ketib, o'z bolalarining diydoriga to'ymaydigan ota-ona — yaxshi ota-ona emas.\n"
      },
      {
        "text": "2. «Tajribam kam»"
      },
      {
        "text": "Butun umr hali yosh ekanligingiz, tajribangiz kamligini aytib yurishingiz mumkin. Alaloqibatda nima bo'lishini bilasizmi? Tajribasizligingizcha qolib ketaverasiz, biroq endi yosh bo'lmaysiz."
      },
      {
        "text": "3. «Bozorda raqobat yuqori»"
      },
      {
        "text": "Bir qaraganda, bugun xuddi olma tushsa startapning boshiga tushadigandek ko'p ko'rinadi. Biroq bu hol ularning ortiq kerak emasligini bildirmaydi, qaytaga imkoniyat mo'l-ko'lligidan dalolat beradi. Kimki muammolarni yechib, olamga ko'pikka burkanmagan nazar bilan qarasa, albatta, mukofotlanadi."
      },
      {
        "text": "4. «Shundoq ham boyman»"
      },
      {
        "text": "Boy bo'lish yetarli emasligini tushuntiruvchi ikki sabab bor: birinchidan, faqat o'zingizga sarflanadigan pul lazzat keltirmaydi, ikkinchidan, startap — millionlarni ko'paytirish usuli. Axir Ilon Mask, «Ey, men shundoq ham boyman, tupurdim hammasiga», demaydi-ku?"
      },
      {
        "text": "5. «Menga erkinlik kerak»"
      },
      {
        "text": "Ha, startap erkinlikdan mahrum qilib, butun vaqtni egallaydi. Lekin falonchi akaga ishlashdan ko'ra buning nimasi yomon? Eng kamida, o'z oldingizga maqsad qo'yganingizdan so'ng barcha qurbonliklar nima uchunligini aniq tushuna boshlaysiz."
      },
      {
        "text": "6. «Barchasi barbod bo'lishi mumkin»"
      },
      {
        "text": "Yuzlab startaplar bir yil ham yashamagan. Millionlab odamlar buning uchun o'z pullarini behudaga sarflashgan. Sizning korxonangiz ham kasodga uchrashi mumkin, boz ustiga buning ehtimoli baland — 50 foiz. Xuddi shuncha ehtimollik bilan osmondan boshingizga g'isht kelib urilishi mumkin. Lekin bu uydan tashqariga chiqmasligingizga sabab bo'la olmaydi-ku, to'g'rimi?"
      }
    ]
  },
  {
    "id": 8,
    "title": "Dasturlash tillari va script tillar farqi",
    "about": "Ko'pincha odamlar script til va dasturlash tilini sinonim o'rnida ishlatishadi, lekin bular o'rtasida katta farq bor",
    "dataText": [
      {
        "text": "Ko'pincha odamlar script til va dasturlash tilini sinonim o'rnida ishlatishadi, lekin bular o'rtasida katta farq bor. Barcha script tillar dasturlash tili lekin hamma dasturlash tillari script til emas."
      },
      {
        "text": "Ancha yillar oldin dasturlash tillari yordamida PowerPoint, Internet Explorer, Microsoft Excel, Microsoft Word va juda ko'p shu kabi dasturlar yozilgan. Biroq, vaqt o'tishi bilan dasturlash tillarini qo'shimcha funktsiyalarni kiritish va takomillashtirilgan dasturlash interfeysi bilan ta'minlash uchun yangilash zarurati paydo bo'ldi."
      },
      {
        "text": "Script tillar va dasturlash tillari orasidagi asosiy farqlardan biri kodlarni ijro etishida. Ya'ni dasturlash tillari yuqori darajali dasturlash (odam chunadigan kod) tilidan mashina kodiga (komputer chunadigan kod) compiler yordamida o'giradi, script tillar esa bu ishda interpereter ishlatadi. Interpreter va Compiler haqida dasturlash asoslarini 2-darsida ma'lumot bergandim. Yana takrorlab o'taman. Compiler kodni to'liq o'giradi, Interpreter esa qatorma qator kodni mashina tiliga o'giradi."
      },
      {
        "text": "Keling, dasturlash tili va Script tili o'rtasidagi boshqa farqlarni ham ko'rib chiqamiz."
      },
      {
        "text": "Dasturlash tillari ixcham bo'lib, boshqa til yoki dasturga interpretatsiya ( o'girilmaydi ) qilinmaydi."
      },
      {
        "text": "Script tillar bitta tilda yozilib va boshqa dasturlar yoki dasturlash tillari yordamida interpretatsiya ( o'girish) qiladi. Misol uchun Javascript HTML bilan birgalikda qo'shilib keyin Internet browser bilan interpretatsiya ( o'griliadi ) qiladi. Shunday qilib, dasturlash tillari mustaqil ravishda ishlaydi, ammo Script tillari boshqa dastur ichida ishlaydi."
      },
      {
        "text": "Dasturlash tillari to'laqonli kod va dasturiy ta'minotni ishlab chiqishni osonlashtirish uchun mo'ljallangan, Script tillari esa kodlashni tezroq va soddalashtirish uchun maxsus ishlab chiqilgan."
      },
      {
        "text": "Dasturlash tillari bilan kodlash nisbatan qiyin, chunki bitta funktsiya uchun ko'plab kod satrlari talab qilinadi. Script tillari bilan funktsiyali kodlar yaratish osonroq, chunki Script tillarda bir muncha qisqaroq kod yoziladi."
      },
      {
        "text": "Shunday qilib, dasturlash tillari bilan to'la-to'kis kod yozish odatda ko'proq vaqtni oladi, Script tillar bilan kodlashda ozroq vaqt talab etiladi."
      },
      {
        "text": "Compilatsiya qilingan dasturlar odatda Interpretatsiya qilingan dasturlarga qaraganda tezroq ishlaydi, chunki kompilyatorlar bir vaqtning o'zida kodni o'qiydilar va tahlil qiladilar va xatolar (agar mavjud bo'lsa) haqida umumiy hisobot beradilar."
      },
      {
        "text": "Lekin Interpreter kod har bir qatorni o'qiydi va tahlil qiladi va har safar xatolikni aniqlaganda, ularga birma-bir murojaat qilishni to'xtatadi."
      },
      {
        "text": "Dasturlash tillariga misol qilib C, C++, C#, Java, Basic, COBOL, va Pascal kabi tillarni olsak bo'ladi. Script tillarga misol qilib JavaScript, Perl, PHP, Python, Ruby, Ruby, GameMonkey va hokazo larni olsak bo'ladi"
      },
      {
        "text": "Dasturlash tillari to'liq uzunlikdagi kod bilan ishlaydi va mustaqil ravishda ishlashga qodir, o'zi mustaqil ijro eta oladi (dastur ko'rinishga keltira oladi), Script tili odatda kodning kichik qismlari ustida ishlaydi va ishlashi (dastur ko'rinishiga kelishi) uchun yordamchi dastur kerak bo'ladi."
      },
      {
        "text": "Script tillari boshqa platformalarga ham bog'liq va ularni joylashtirish kerak. Dasturlash tillari .exe fayllarini yaratadi, Script tillari esa .exe bajariladigan fayllarini yaratishda qatnashmaydi."
      }
    ]
  },
  {
    "id": 9,
    "title": "UTF-8: Boshidan-oxirigacha! 1-qism!",
    "about": "PHP ni endi o'rganishni boshlaganimda, \"Салом\" so'zini bazadan o'qib brovzerda chiqaraman desam \"РЎР°Р»РѕРј\" shunga o'xshash narsalar chiqib qolgan",
    "dataText": [
      {
        "text": "PHP ni endi o'rganishni boshlaganimda, \"Салом\" so'zini bazadan o'qib brovzerda chiqaraman desam \"РЎР°Р»РѕРј\" shunga o'xshash narsalar chiqib qolgan. Endi o'rganishni boshlagan dasturchi uchun bu juda g'alati narsalar bo'lib tuyulgan. Bu xatoni to'g'rilash uchun:"
      },
      {
        "text": "1. Ma'lumotlar bazasida barcha ustun va jadvallarni utf8_general_ci ga qo'yish"
      },
      {
        "text": "2. MySQL ulanganda: mysql_query('SET NAMES UTF8');"
      },
      {
        "text": "3. PHP fayllarni hammasini UTF-8 da saqlash"
      },
      {
        "text": "4. HTML sahifaga <meta charset=\"utf-8\">"
      },
      {
        "text": "5. PHP da header(\"Content-type: text/html; charset: utf-8\");"
      },
      {
        "text": "ko'rinishidagi sozlashlarni qilish zarurati tug'ilgan. Hozirgi kunda yangi o'rganayotgan web dasturchilar bunaqa sozlashlarni qilmasa kerak, chunki ko'pchilik framework ishlatishi sababli, frameworklarning o'zlari yuqoridagi sozlashlarni siz uchun \"default\" holatda qilishadi. Ya'ni siz hech qanday sozlashlar qilmasangiz, hammasi yuqoridagiday sozlangan bo'ladi."
      },
      {
        "text": "E'tibor berayotgan bo'lsangiz, UTF-8 shunchalik hayotimizga kirib keldiki, hozirgi web saytlarni usiz tasavvur qilish juda qiyin, ayniqsa O'zbekistonda! Chunki O'zbekistonda bir vaqtda lotincha va krillcha harflarni qo'llaydigan sayt qilish kerakda? :)"
      },
      {
        "text": "Keling endi UTF-8 o'zi nima? degan savol javob berishga harakat qilib ko'rsak. Agar qisqacha javob bersam, bu bir nechta kodlash jadvallaridan biridir. Tushunmadingizmi, o'qishda davom eting."
      },
      {
        "text": "Manimcha ko'pchilik maktab darsliklarida ASCII degan narsani eshitgan. Aslida bu ham kodlash jadvalidir. Faqat buning kamchligi, atigi 128 ta belgini qo'llab-quvvatlaydi. Qolgan 0x80-0xFF oraliqlari kengaytirilgan bo'lib, tanlangan kodlash jadvalidan kelib chiqib o'zgarishi mumkin. Misol uchun windows-1250 va windows-1251 jadvallariga qarasangiz kodlar bir-xil, lekin belgilar farqlanadi."
      },
      {
        "text": "Yuqoridagilardan tashqari, har bitta korxona o'zining maxsulotlari uchun kodlash jadvallar yaratishni boshlagan. Misol uchun, MacCyrillic Macintosh kompyuterlari uchun."
      },
      {
        "text": "Agar e'tibor bergan bo'lsangiz, yuqorida keltirgan 3 ta kodlash jadvallari 0x00 dan 0xFF gacha bo'lib, 8 bitli kodlash jadvallari guruhiga mansubdir. Bunaqa turdagi kodlash jadvallarining qo'llashdagi qiyinchiligini quyidagi misol bilan tushuntirsam."
      },
      {
        "text": "Windows-1251 da krillcha \"Щ\" belgisi 0xD9 kodida turibdi, MacCyrillic da esa 0x99 da! Tasavvur qiling, windows-1251 da ishlaydigan dastur \"Щ\" harfini tarmoqda jo'natsa 0xD9 kodini (bayt) yuboradi. Macintoshda ishlayotgan foydalanuvchiga esa \"ў\" belgisi (0xD9) chiqqan bo'lardi. Chunki undagi kodlash jadvali MacCyrillic!"
      },
      {
        "text": "Shunaqa har xil muammolar kelib chiqqandan keyin, UNICODE standarti dunyo yuzini ko'rdi. UNICODE standart bo'lib, yuqoridagilardan farqi 1 mln. dan ortiq belgilarni saqlash mumkin."
      },
      {
        "text": "UNICODE bu standard, shu UNICODE asosida ishlaydigan kodlash jadvallari esa UTF-8, UTF-16, va UTF-32 (yana bor ... :) )."
      },
      {
        "text": "UTF-16 va UTF-32 bular mos ravishda o'zgarmas (O'ZGARMAS) 16 (2 bayt) va 32 (4 bayt) bitli uzunlikdagi belgilar to'plamidir. UTF-8 da sal boshqacharoq."
      },
      {
        "text": "Misol uchun, UTF-8 da logincha \"A\" harfi 1 bayt (0x41), krillcha \"Щ\" harfi 2 bayt (0xd0a9), yaponcha \"ぁ\" (kichik A) belgisi 3 bayt (0xe38181) va \"𐄳\" belgisi 4 bayt (0xf09084b3). (to'liq jadval). Ya'ni UTF-8 da kodlangan belgilar 1 baytdan 4 baytgacha bo'lishi mumkin. Bu nima uchun kerak?"
      },
      {
        "text": "Biz bilamizki internet olamida deyarli barcha dasturlar, web sahifalar (HTML/CSS,JS) lotin harfida yoziladi. Agar biz \"default\" UTF-16 ni ishlatganimizda, telegramdan yozgan har bir lotincha harfimizga ortiqcha 1 bayt trafik ishlatardik. Shu tariqa har bir ochgan web sahifamizga ham 2 barobar ko'proq trafik sarflagan bo'lardik. UTF-8 ning shu darajada mashxur bo'lishiga asosiy sabab dastlabki 128 ta belgi ASCII jadvali bilan bir-xil bo'lib, ikkalasida ham 1 bayt joy egallaydi. Ushbu 128 ta belgi, lotin harflarini va dasturlashda ko'p ishlatiladigan belgilarni o'z ichiga oladi."
      }
    ]
  }
]
